<html><head><meta http-equiv=Content-Type content='text/html; charset=UTF-8'></head>
<html>
<body bgcolor=#ffffff>
 
<a name="106559">
Copyright &#169; 2000 Sun Microsystems, Inc., 901 San Antonio Road, Palo Alto, CA 94303-4900 USA. All rights reserved. <p>
</a>
<a name="106560">
This product or document is distributed under licenses restricting its use, copying, distribution, and decompilation. No part of this product or document may be reproduced in any form by any means without prior written authorization of Sun and its licensors, if any. Third-party software, including font technology, is copyrighted and licensed from Sun suppliers.<p>
</a>
<a name="996896">
Parts of the product may be derived from Berkeley BSD systems, licensed from the University of California. UNIX is a registered trademark in the U.S. and other countries, exclusively licensed through X/Open Company, Ltd. For Netscape<sup>TM</sup>, Netscape Navigator<sup>TM</sup>, and the Netscape Communications Corporation logo<sup>TM</sup>, the following notice applies: Copyright 1995 Netscape Communications Corporation. All rights reserved.<p>
</a>
<a name="996845">
Sun, Sun Microsystems, the Sun logo, docs.sun.com, AnswerBook2, Solaris, SunOS, JavaScript, SunExpress, Sun WorkShop, Sun WorkShop Professional, Sun Performance Library, Sun Performance WorkShop, Sun Visual WorkShop, and Forte are trademarks, registered trademarks, or service marks of Sun Microsystems, Inc. in the U.S. and other countries. All SPARC trademarks are used under license and are trademarks or registered trademarks of SPARC International, Inc. in the U.S. and other countries. Products bearing SPARC trademarks are based upon an architecture developed by Sun Microsystems, Inc.<p>
</a>
<a name="996911">
The OPEN LOOK and Sun<sup>TM</sup> Graphical User Interface was developed by Sun Microsystems, Inc. for its users and licensees. Sun acknowledges the pioneering efforts of Xerox in researching and developing the concept of visual or graphical user interfaces for the computer industry. Sun holds a non-exclusive license from Xerox to the Xerox Graphical User Interface, which license also covers Sun&#39;s licensees who implement OPEN LOOK GUIs and otherwise comply with Sun&#39;s written license agreements.<p>
</a>
<a name="996807">
f90/f95 is derived from Cray CF90<sup>TM</sup>, a product of Silicon Graphics, Inc.<p>
</a>
<a name="106564">
Federal Acquisitions: Commercial Software&#45;&#45;Government Users Subject to Standard License Terms and Conditions.<p>
</a>
<a name="106565">
DOCUMENTATION IS PROVIDED &#34;AS IS&#34; AND ALL EXPRESS OR IMPLIED CONDITIONS, REPRESENTATIONS AND WARRANTIES, INCLUDING ANY IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT, ARE DISCLAIMED, EXCEPT TO THE EXTENT THAT SUCH DISCLAIMERS ARE HELD TO BE LEGALLY INVALID.<p>
</a>
<a name="106566">
Copyright &#169; 2000 Sun Microsystems, Inc., 901 San Antonio Road, Palo Alto, CA 94303-4900 Etats-Unis. Tous droits r&eacute;serv&eacute;s. <p>
</a>
<a name="106567">
Ce produit ou document est prot&eacute;g&eacute; par un copyright et distribu&eacute; avec des licences qui en restreignent l&#39;utilisation, la copie, la distribution, et la d&eacute;compilation. Aucune partie de ce produit ou document ne peut &ecirc;tre reproduite sous aucune forme, par quelque moyen que ce soit, sans l&#39;autorisation pr&eacute;alable et &eacute;crite de Sun et de ses bailleurs de licence, s&#39;il y en a. Le logiciel d&eacute;tenu par des tiers, et qui comprend la technologie relative aux polices de caract&egrave;res, est prot&eacute;g&eacute; par un copyright et licenci&eacute; par des fournisseurs de Sun.<p>
</a>
<a name="106568">
Des parties de ce produit pourront &ecirc;tre d&eacute;riv&eacute;es des syst&egrave;mes Berkeley BSD licenci&eacute;s par l&#39;Universit&eacute; de Californie. UNIX est une marque d&eacute;pos&eacute;e aux Etats-Unis et dans d&#39;autres pays et licenci&eacute;e exclusivement par X/Open Company, Ltd. La notice suivante est applicable &agrave; Netscape<sup>TM</sup>, Netscape Navigator<sup>TM</sup>, et the Netscape Communications Corporation logo<sup>TM</sup>: Copyright 1995 Netscape Communications Corporation. Tous droits r&eacute;serv&eacute;s. <p>
</a>
<a name="106569">
Sun, Sun Microsystems, the Sun logo, docs.sun.com, AnswerBook2, Solaris, SunOS, JavaScript, SunExpress, Sun WorkShop, Sun WorkShop Professional, Sun Performance Library, Sun Performance WorkShop, Sun Visual WorkShop, et Forte sont des marques de fabrique ou des marques d&eacute;pos&eacute;es, ou marques de service, de Sun Microsystems, Inc. aux Etats-Unis et dans d&#39;autres pays. Toutes les marques SPARC sont utilis&eacute;es sous licence et sont des marques de fabrique ou des marques d&eacute;pos&eacute;es de SPARC International, Inc. aux Etats-Unis et dans d&#39;autres pays. Les produits portant les marques SPARC sont bas&eacute;s sur une architecture d&eacute;velopp&eacute;e par Sun Microsystems, Inc. <p>
</a>
<a name="106570">
L&#39;interface d&#39;utilisation graphique OPEN LOOK et Sun<sup>TM</sup> a &eacute;t&eacute; d&eacute;velopp&eacute;e par Sun Microsystems, Inc. pour ses utilisateurs et licenci&eacute;s. Sun reconna&icirc;t les efforts de pionniers de Xerox pour la recherche et le d&eacute;veloppement du concept des interfaces d&#39;utilisation visuelle ou graphique pour l&#39;industrie de l&#39;informatique. Sun d&eacute;tient une licence non exclusive de Xerox sur l&#39;interface d&#39;utilisation graphique Xerox, cette licence couvrant &eacute;galement les licenci&eacute;s de Sun qui mettent en place l&#39;interface d&#39;utilisation graphique OPEN LOOK et qui en outre se conforment aux licences &eacute;crites de Sun.<p>
</a>
<p>CETTE PUBLICATION EST FOURNIE &#34;EN L&#39;ETAT&#34; ET AUCUNE GARANTIE, EXPRESSE OU IMPLICITE, N&#39;EST ACCORDEE, Y COMPRIS DES GARANTIES CONCERNANT LA VALEUR MARCHANDE, L&#39;APTITUDE DE LA PUBLICATION A REPONDRE A UNE UTILISATION PARTICULIERE, OU LE FAIT QU&#39;ELLE NE SOIT PAS CONTREFAISANTE DE PRODUIT DE TIERS. CE DENI DE GARANTIE NE S&#39;APPLIQUERAIT PAS, DANS LA MESURE OU IL SERAIT TENU JURIDIQUEMENT NUL ET NON AVENU.



<br>

<br> 


